package org.fn.core.exception.errorcode;

import lombok.Getter;

/**
 * @author chenshoufeng
 * @since 2026/3/17 上午11:12
 **/
@Getter
public enum ClientErrorCode implements ErrorCode {
    A0001(400, "用户端错误"),

    A0100(400, "用户注册错误"),
    A0101(400, "用户未同意隐私协议"),
    A0102(403, "注册国家或地区有限"),
    A0110(400, "用户名校验失败"),
    A0111(409, "用户名已存在"),
    A0112(400, "用户名包含敏感词"),
    A0113(400, "用户名包含特殊字符"),
    A0120(400, "密码校验失败"),
    A0121(400, "密码长度不够"),
    A0122(400, "密码强度不够"),
    A0130(400, "校验码输入错误"),
    A0131(400, "短信校验码输入错误"),
    A0132(400, "邮件校验码输入错误"),
    A0133(400, "语音校验码输入错误"),

    A0140(400, "用户证件异常"),
    A0141(400, "用户证件类型未选择"),
    A0142(400, "大陆身份证编号校验非法"),
    A0143(400, "护照编号校验非法"),
    A0144(400, "军官证编号校验非法"),

    A0150(400, "用户基本信息校验失败"),
    A0151(400, "手机格式校验失败"),
    A0152(400, "地址格式校验失败"),
    A0153(400, "邮箱格式校验失败"),

    A0200(401, "用户登录异常"),
    A0201(401, "用户账户不存在"),
    A0202(403, "用户账户被冻结"),
    A0203(403, "用户账户已作废"),
    A0210(401, "用户密码错误"),
    A0211(429, "用户输入密码错误次数超限"),

    A0220(401, "用户身份校验失败"),
    A0221(401, "用户指纹识别失败"),
    A0222(401, "用户面容识别失败"),
    A0223(401, "用户未获得第三方登录授权"),

    A0230(401, "用户登录已过期"),

    A0240(400, "用户验证码错误"),
    A0241(429, "用户验证码尝试次数超限"),

    A0300(403, "访问权限异常"),
    A0301(401, "访问未授权"),
    A0302(202, "正在授权中"),
    A0303(403, "用户授权申请被拒绝"),

    A0310(403, "因访问对象隐私设置被拦截"),
    A0311(401, "授权已过期"),
    A0312(403, "无权限使用 API"),

    A0320(403, "用户访问被拦截"),
    A0321(403, "黑名单用户"),
    A0322(403, "账户被冻结"),
    A0323(403, "非法 IP 地址"),
    A0324(403, "网关访问受限"),
    A0325(403, "地域黑名单"),

    A0330(402, "服务已欠费"),

    A0340(401, "用户签名异常"),
    A0341(401, "RSA 签名错误"),

    A0400(400, "用户参数请求错误"),
    A0401(400, "包含非法恶意跳转链接"),
    A0402(400, "无效的用户输入"),

    A0410(400, "请求必填参数为空"),
    A0411(400, "用户订单号为空"),
    A0412(400, "订购数量为空"),
    A0413(400, "缺少时间戳参数"),
    A0414(400, "非法的时间戳参数"),

    A0420(400, "请求参数值超出允许的范围"),
    A0421(400, "参数格式不匹配"),
    A0422(403, "地址不在服务范围"),
    A0423(403, "时间不在服务范围"),
    A0424(400, "金额超出限制"),
    A0425(400, "数量超出限制"),
    A0426(400, "请求批量处理总个数超出限制"),
    A0427(400, "请求 JSON 解析失败"),

    A0430(400, "用户输入内容非法"),
    A0431(400, "包含违禁敏感词"),
    A0432(400, "图片包含违禁信息"),
    A0433(403, "文件侵犯版权"),

    A0440(409, "用户操作异常"),
    A0441(408, "用户支付超时"),
    A0442(408, "确认订单超时"),
    A0443(409, "订单已关闭"),

    A0500(503, "用户请求服务异常"),
    A0501(429, "请求次数超出限制"),
    A0502(429, "请求并发数超出限制"),
    A0503(429, "用户操作请等待"),
    A0504(503, "WebSocket 连接异常"),
    A0505(503, "WebSocket 连接断开"),
    A0506(429, "用户重复请求"),

    A0600(400, "用户资源异常"),
    A0601(402, "账户余额不足"),
    A0602(507, "用户磁盘空间不足"),
    A0603(507, "用户内存空间不足"),
    A0604(507, "用户 OSS 容量不足"),
    A0605(403, "用户配额已用光"),

    A0700(400, "用户上传文件异常"),
    A0701(400, "用户上传文件类型不匹配"),
    A0702(413, "用户上传文件太大"),
    A0703(413, "用户上传图片太大"),
    A0704(413, "用户上传视频太大"),
    A0705(413, "用户上传压缩文件太大"),

    A0800(400, "用户当前版本异常"),
    A0801(400, "用户安装版本与系统不匹配"),
    A0802(426, "用户安装版本过低"),
    A0803(400, "用户安装版本过高"),
    A0804(410, "用户安装版本已过期"),
    A0805(400, "用户 API 请求版本不匹配"),
    A0806(400, "用户 API 请求版本过高"),
    A0807(400, "用户 API 请求版本过低"),

    A0900(403, "用户隐私未授权"),
    A0901(403, "用户隐私未签署"),
    A0902(403, "用户摄像头未授权"),
    A0903(403, "用户相机未授权"),
    A0904(403, "用户图片库未授权"),
    A0905(403, "用户文件未授权"),
    A0906(403, "用户位置信息未授权"),
    A0907(403, "用户通讯录未授权"),

    A1000(500, "用户设备异常"),
    A1001(500, "用户相机异常"),
    A1002(500, "用户麦克风异常"),
    A1003(500, "用户听筒异常"),
    A1004(500, "用户扬声器异常"),
    A1005(500, "用户 GPS 定位异常"),
    ;

    private final String desc;
    private final int httpStatusCode;

    ClientErrorCode(int httpStatusCode, String desc) {
        this.httpStatusCode = httpStatusCode;
        this.desc = desc;
    }

    @Override
    public String getCode() {
        return name();
    }

    @Override
    public String getI18n() {
        return "ERROR_CODE.CLIENT." + name();
    }
}
